loadtest/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Warm-up"
    - duration: 120
      arrivalRate: 1000
      name: "Sustained 1000 rps"
  defaults:
    headers:
      Content-Type: application/json      scrape_configs:
        - job_name: 'prometheus'
          static_configs:
            - targets: ['localhost:9090']
        - job_name: 'otel-collector'
          static_configs:
            - targets: ['otel-collector:8888']
  processor: "./processor.js"

global:
  scrape_interval: 15s

scrape_configs:
  - job_name: 'prometheus'
    static_configs:
      - targets: ['localhost:9090']
  - job_name: 'otel-collector'
    static_configs:
      - targets: ['otel-collector:8888']
      
scenarios:
  - name: "Mixed API traffic"
    flow:
      - function: "chooseEndpoint"
      - get:
          url: "{{ endpoint }}"
  - name: Payment API flood
    flow:
      - post:
          url: "/api/payments/pay"
          json:
            amount: 199.99
            currency: "USD"
            source: "loadtest"